# Developer Tools
brew "ascii"
brew "cloc"
brew "fswatch"
brew "git"
brew "lazygit"
brew "rcs"
brew "shellcheck"
brew "xcodes"

# Document Preparation
brew "asymptote"
brew "lilypond"
brew "pandoc"
cask "mactex"

# Graphics
brew "graphviz"
brew "potrace"

# Cryptography and Password Management
brew "gnupg"
brew "pass"

# E-Mail
brew "lynx"
brew "mutt"
brew "urlview"

# Web
brew "hurl"
brew "jq"
brew "wget"

# Shell
brew "fzf"
brew "z"
brew "zsh"

# Utilities
brew "fdupes"
brew "ffmpeg"
brew "flac"
brew "id3v2"
brew "imagemagick"
brew "mas"
brew "lame"
brew "mp3splt"
brew "pdfgrep"
brew "poppler"
brew "sox"
brew "tesseract"
brew "yt-dlp"
brew "zbar"

# VisiData
brew "visidata"

# X11
brew "feh"
cask "xquartz"

# Fonts
cask "font-b612"
cask "font-iosevka"
cask "font-optician-sans"

# macOS Applications (free, open source)
cask "blender"
cask "calibre"
cask "cyberduck"
cask "firefox"
cask "handbrake-app"
cask "mactracker"
cask "macvim-app"
cask "mediathekview"
cask "obs"
cask "omnidisksweeper"
cask "openmtp"
cask "signal"
cask "thunderbird"
cask "trex"
cask "upscayl"
cask "visual-studio-code"
cask "vlc"

# macOS Applications (commercial)
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "airfoil"
cask "audio-hijack"
cask "divvy"
cask "little-snitch"
cask "loopback"
cask "messenger"
cask "reaper"
cask "solvespace"
cask "spotify"
cask "tableplus"
cask "whatsapp"

# Non-Homebrew
# https://rustup.rs/
# https://www.haskell.org/ghcup/
# https://github.com/twostraws/ControlRoom
# https://github.com/js/Differati

# Rosetta
# % softwareupdate --install-rosetta
