# Developer Tools
brew "ascii"
brew "fswatch"
brew "git"
brew "shellcheck"

# Document Preparation
brew "asymptote"
cask "mactex"

# Cryptography and Password Management
brew "gnupg"
brew "pass"

# E-Mail
brew "lynx"
brew "mutt"
brew "urlview"

# Web
brew "hurl"
brew "jq"
brew "wget"

# Shell
brew "z"
brew "zsh"

# Utilities
brew "fdupes"
brew "ffmpeg"
brew "imagemagick"
brew "poppler"
brew "sox"
brew "tesseract"

# VisiData
tap "saulpw/vd"
brew "saulpw/vd/visidata"
brew "pyyaml"

# X11
brew "feh"
cask "xquartz"

# Fonts
tap "homebrew/cask-fonts"
cask "font-iosevka"

# macOS Applications (free, open source)
cask "background-music"
cask "calibre"
cask "firefox"
cask "mactracker"
cask "macvim"
cask "obs"
cask "omnidisksweeper"
cask "openmtp"
cask "signal"
cask "thunderbird"
cask "trex"
cask "upscayl"
cask "visual-studio-code"
cask "vlc"

# macOS Applications (commercial)
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "airfoil"
cask "audio-hijack"
cask "divvy"
cask "little-snitch"
cask "solvespace"
cask "spotify"

# Non-Homebrew
# https://rustup.rs/
# https://www.haskell.org/ghcup/

# Rosetta
# % softwareupdate --install-rosetta
