# Developer Tools
brew "asymptote"
brew "fswatch"
brew "git"
brew "shellcheck"

# Cryptography and Password Management
brew "gnupg"
brew "pass"

# E-Mail
brew "lynx"
brew "mutt"
brew "urlview"

# Web
brew "hurl"
brew "jq"
brew "wget"

# Shell
brew "z"
brew "zsh"

# Utilities
brew "tesseract"
brew "fdupes"

# X11
brew "feh"
cask "xquartz"

# macOS Applications (free, open source)
cask "firefox"
cask "macvim"
cask "omnidisksweeper"
cask "thunderbird"
cask "trex"
cask "visual-studio-code"
cask "vlc"

# macOS Applications (commercial)
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "airfoil"
cask "audio-hijack"
cask "divvy"
cask "spotify"

# Non-Homebrew
# https://rustup.rs/
# https://www.haskell.org/ghcup/
